; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v6 ?v3)
             (pred_4 ?v8 ?v13)
             (pred_2 ?v6 ?v13)
             (pred_3 ?v12 ?v6 )
	     (pred_8 ?v6)
             (pred_10 ?v5)
             (pred_7 ?v8)
             (pred_9 ?v13)
             (pred_1 ?v6)
             (pred_6 ?v8)
             (pred_12 ?v6)
             (pred_5 ))



(:action op_5
:parameters (?v11 ?v4 ?v10 ?v2)
:precondition (and (pred_10 ?v11) (pred_10 ?v4) (pred_7 ?v10) (pred_9 ?v2)
          (pred_11 ?v11 ?v4) (pred_4 ?v10 ?v2)
                   (pred_2 ?v4 ?v2) (pred_8 ?v11) 
                   (pred_1 ?v4) (pred_6 ?v10))
:effect (and  (pred_12 ?v4) (not (pred_1 ?v4))))


(:action op_1
:parameters (?v11 ?v1)
:precondition (and (pred_10 ?v11) (pred_10 ?v1)
               (pred_8 ?v11) (pred_11 ?v11 ?v1) (pred_12 ?v1))
:effect (and (pred_8 ?v1) (not (pred_8 ?v11))))

(:action op_3
:parameters (?v11 ?v10)
:precondition (and (pred_10 ?v11) (pred_7 ?v10) 
                  (pred_8 ?v11) (pred_3 ?v10 ?v11) (pred_5 ))
:effect (and (pred_6 ?v10)
   (not (pred_3 ?v10 ?v11)) (not (pred_5 ))))


(:action op_4
:parameters (?v11 ?v7 ?v9)
:precondition (and (pred_10 ?v11) (pred_7 ?v7) (pred_7 ?v9)
                  (pred_8 ?v11) (pred_6 ?v9) (pred_3 ?v7 ?v11))
:effect (and (pred_6 ?v7) (pred_3 ?v9 ?v11)
        (not (pred_6 ?v9)) (not (pred_3 ?v7 ?v11))))

(:action op_2
:parameters (?v11 ?v10)
:precondition (and (pred_10 ?v11) (pred_7 ?v10) 
                  (pred_8 ?v11) (pred_6 ?v10))
:effect (and (pred_5 ) (pred_3 ?v10 ?v11) (not (pred_6 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_14 obj_10 obj_12 obj_15 obj_16 obj_17 obj_02 obj_08 obj_13 obj_03 obj_18 obj_06 obj_05 obj_19 obj_11
    obj_01 obj_09
    obj_04 obj_20
    )

    (:init
       (pred_5)

       (pred_10 obj_07)
       (pred_10 obj_14)
       (pred_10 obj_10)
       (pred_10 obj_12)
       (pred_10 obj_15)
       (pred_10 obj_16)
       (pred_10 obj_17)
       (pred_10 obj_02)
       (pred_10 obj_08)
       (pred_10 obj_13)
       (pred_10 obj_03)
       (pred_10 obj_18)
       (pred_10 obj_06)
       (pred_10 obj_05)
       (pred_10 obj_19)
       (pred_10 obj_11)
       (pred_9 obj_01)
       (pred_9 obj_09)
       (pred_7 obj_04)
       (pred_7 obj_20)

       (pred_11 obj_07 obj_15)
       (pred_11 obj_07 obj_14)
       (pred_11 obj_14 obj_16)
       (pred_11 obj_14 obj_10)
       (pred_11 obj_14 obj_07)
       (pred_11 obj_10 obj_17)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_10 obj_14)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_15 obj_16)
       (pred_11 obj_15 obj_07)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_16 obj_17)
       (pred_11 obj_16 obj_14)
       (pred_11 obj_16 obj_15)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_17 obj_02)
       (pred_11 obj_17 obj_10)
       (pred_11 obj_17 obj_16)
       (pred_11 obj_02 obj_18)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_02 obj_17)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_08 obj_13)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_13 obj_03)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_13 obj_08)
       (pred_11 obj_03 obj_19)
       (pred_11 obj_03 obj_18)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_03 obj_13)
       (pred_11 obj_18 obj_11)
       (pred_11 obj_18 obj_02)
       (pred_11 obj_18 obj_03)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_05 obj_13)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_19 obj_11)
       (pred_11 obj_19 obj_03)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_11 obj_18)
       (pred_11 obj_11 obj_19)
       (pred_1 obj_19)
       (pred_1 obj_18)
       (pred_2  obj_19 obj_01)
       (pred_2  obj_18 obj_09)
       (pred_12 obj_07)
       (pred_12 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_12)
       (pred_12 obj_15)
       (pred_12 obj_16)
       (pred_12 obj_17)
       (pred_12 obj_02)
       (pred_12 obj_08)
       (pred_12 obj_13)
       (pred_12 obj_03)
       (pred_12 obj_06)
       (pred_12 obj_05)
       (pred_12 obj_11)

       (pred_4  obj_04 obj_01)
       (pred_4  obj_20 obj_09)
       (pred_3 obj_04 obj_11)
       (pred_3 obj_20 obj_08)
       (pred_8 obj_16)
    )

    (:goal (and
       (pred_3 obj_20 obj_03)
    ))
(:constraints
  (always (not (pred_8 obj_13)))
)
)

; plan
1. (op_1 obj_16 obj_15)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_15)
   goals met: 0 of 1
2. (op_1 obj_15 obj_08)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_08)
   goals met: 0 of 1
3. (op_3 obj_08 obj_20)
   deleted: (pred_3 obj_20 obj_08) (pred_5)
   added: (pred_6 obj_20)
   goals met: 0 of 1
4. (op_1 obj_08 obj_15)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_15)
   goals met: 0 of 1
5. (op_1 obj_15 obj_16)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_16)
   goals met: 0 of 1
6. (op_1 obj_16 obj_17)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_17)
   goals met: 0 of 1
7. (op_1 obj_17 obj_03)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_03)
   goals met: 0 of 1
8. (op_2 obj_03 obj_20)
   deleted: (pred_6 obj_20)
   added: (pred_5) (pred_3 obj_20 obj_03)
   goals met: 1 of 1
